johnnycuenca/SeniorDesign_Quadcopter_TM4C/compdcm_mpu9150 - Copy/compdcm_mpu9150.c
	ulstatus = GPIOIntStatus(GPIO_PORTD_BASE, true);
	
	GPIOIntClear(GPIO_PORTD_BASE, ulstatus);
	
	if(ulstatus & GPIO_PIN_7)
	{
		if((GPIOPinRead(GPIO_PORTD_BASE, 128)&(0x80)) == 0)
		{
				g_sMotorInst.currentSpeed = MINSPEED;
		}
		
	}
}

//*****************************************************************************
//
// Called by the NVIC as a result of I2C3 Interrupt. I2C3 is the I2C connection
// to the MPU9150.
//
//*****************************************************************************
void
MPU9150I2CIntHandler(void)
{
    //
    // Pass through to the I2CM interrupt handler provided by sensor library.
    // This is required to be at application level so that I2CMIntHandler can
    // receive the instance structure pointer as an argument.
    //
    I2CMIntHandler(&g_sI2CInst);
}

//*****************************************************************************
//
// MPU9150 Application error handler. Show the user if we have encountered an
// I2C error.
//
//*****************************************************************************
void
MPU9150AppErrorHandler(char *pcFilename, uint_fast32_t ui32Line)
{
    //
    // Set terminal color to red and print error status and locations
    //
    UARTprintf("\033[31;1m");
    UARTprintf("Error: %d, File: %s, Line: %d\n"
               "See I2C status definitions in sensorlib\\i2cm_drv.h\n",
               g_vui8ErrorFlag, pcFilename, ui32Line);

    //
    // Return terminal color to normal
    //
    UARTprintf("\033[0m");

    //
    // Set RGB Color to RED
    //
    g_pui32Colors[0] = 0xFFFF;
    g_pui32Colors[1] = 0;
    g_pui32Colors[2] = 0;
//    RGBColorSet(g_pui32Colors);

    //
    // Increase blink rate to get attention
    //
  //  RGBBlinkRateSet(10.0f);

    //
    // Go to sleep wait for interventions.  A more robust application could
    // attempt corrective actions here.
    //
    while(1)
    {
        //
        // Do Nothing
        //
    }
}

//*****************************************************************************
//
// Function to wait for the MPU9150 transactions to complete. Use this to spin
// wait on the I2C bus.
//
//*****************************************************************************
void
MPU9150AppI2CWait(char *pcFilename, uint_fast32_t ui32Line)
{
    //
    // Put the processor to sleep while we wait for the I2C driver to
    // indicate that the transaction is complete.
    //
    while((g_vui8I2CDoneFlag == 0) && (g_vui8ErrorFlag == 0))
    {
        //
        // Do Nothing
        //
    }

    //
    // If an error occurred call the error handler immediately.
    //
    if(g_vui8ErrorFlag)
    {
        MPU9150AppErrorHandler(pcFilename, ui32Line);
    }

    //
    // clear the data flag for next use.
    //
    g_vui8I2CDoneFlag = 0;
}

//*****************************************************************************
//
// Configure the UART and its pins.  This must be called before UARTprintf().
//
//*****************************************************************************
void
ConfigureUART(void)
{
    //
    // Enable the GPIO Peripheral used by the UART.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
	  

    //
    // Enable UART0
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART0);
	
    //
    // Configure GPIO Pins for UART mode.
    //
    ROM_GPIOPinConfigure(GPIO_PA0_U0RX);
    ROM_GPIOPinConfigure(GPIO_PA1_U0TX);
    ROM_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);
	
	
	  

    //
    // Use the internal 16MHz oscillator as the UART clock source.
    //
    UARTClockSourceSet(UART0_BASE, UART_CLOCK_PIOSC);
		
		

    //
    // Initialize the UART for console I/O.
    //
    UARTStdioConfig(0, 115200, 16000000);
		
		
		
		
}

void ConfigureUART1(void)
{
	ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
	
	//Enable UART1
		ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UART1);
	
	ROM_GPIOPinConfigure(GPIO_PC4_U1RX);
    ROM_GPIOPinConfigure(GPIO_PC5_U1TX);
    ROM_GPIOPinTypeUART(GPIO_PORTC_BASE, GPIO_PIN_4 | GPIO_PIN_5);
	
	UARTClockSourceSet(UART1_BASE, UART_CLOCK_PIOSC);
	
	UARTConfigSetExpClk(UART1_BASE, 16000000, 115200, (UART_CONFIG_WLEN_8 | UART_CONFIG_STOP_ONE | UART_CONFIG_PAR_NONE));
}

//*****************************************************************************
//
// Main application entry point.
//
//*****************************************************************************
int main(void)
{
    int_fast32_t i32IPart[16], i32FPart[16];
    uint_fast32_t ui32Idx, ui32CompDCMStarted;
    float pfData[16];
    float *pfAccel, *pfGyro, *pfMag, *pfEulers, *pfQuaternion;
		bool setPointIsSet = false;
	  
	  int motor1, motor2, motor3, motor4;
	  float gyroRoll;
	
	/* Used from bluetooth demo
		char letter = 'o';
		int motor1 = 4000; //PB6
		int motor2 = 4000; //PB7
		int motor3 = 4000; //PB4
		int motor4 = 4000; //PB5
*/	   
    
    //
    // Initialize convenience pointers that clean up and clarify the code
    // meaning. We want all the data in a single contiguous array so that
    // we can make our pretty printing easier later.
    //
    pfAccel = pfData;
    pfGyro = pfData + 3;
    pfMag = pfData + 6;
    pfEulers = pfData + 9;
    pfQuaternion = pfData + 12;

    //
    // Setup the system clock to run at 40 Mhz from PLL with crystal reference
    //
		
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_5 | SYSCTL_USE_PLL | SYSCTL_XTAL_16MHZ |
                      SYSCTL_OSC_MAIN);
											
											 
		ROM_SysCtlPWMClockSet(SYSCTL_PWMDIV_64);

		//Enable PWM0 Module (There are 4 generators inside each module)
		ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM0);
		
		//Enable PWM1 Module
		ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM1);
		
    //
    // Enable port B used for motion interrupt. and PWM on PB4 and PB5
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
		
		
		//Enable port F for PWM on PF2 and PF3
		ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
		
		
		ROM_GPIOPinTypePWM(GPIO_PORTB_BASE, GPIO_PIN_4);
		ROM_GPIOPinConfigure(GPIO_PB4_M0PWM2);
		ROM_GPIOPinTypePWM(GPIO_PORTB_BASE, GPIO_PIN_5);
		ROM_GPIOPinConfigure(GPIO_PB5_M0PWM3);
		ROM_GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_2);
		ROM_GPIOPinConfigure(GPIO_PF2_M1PWM6);
		ROM_GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_3);
		ROM_GPIOPinConfigure(GPIO_PF3_M1PWM7);
		
		
				
				
		// Wait for the PWM0 module to be ready.

		while(!SysCtlPeripheralReady(SYSCTL_PERIPH_PWM0)&&!SysCtlPeripheralReady(SYSCTL_PERIPH_PWM1))
		{
		}

