johnnycuenca/SeniorDesign_Quadcopter_TM4C/compdcm_mpu9150 - Copy/compdcm_mpu9150.c
		//Configuring Generator 3 Module 1
		ROM_PWMGenConfigure(PWM1_BASE, PWM_GEN_3,
		                PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
		
		//Configuring Generator 1 Module 0 
		ROM_PWMGenConfigure(PWM0_BASE, PWM_GEN_1,
		                PWM_GEN_MODE_DOWN | PWM_GEN_MODE_NO_SYNC);
		
		// Set the period. For a 50 Hz frequency, the period = 1/50, or 20
    // millliseconds. For a 40 MHz clock, this translates to 800000 clock ticks.
    // Use this value to set the period.
    //
    ROM_PWMGenPeriodSet(PWM1_BASE, PWM_GEN_3, 12500);
		
		//Setting same period as generator 1
		ROM_PWMGenPeriodSet(PWM0_BASE, PWM_GEN_1, 12500);
		
		//Set all PWM pulses to 10%. So this generates a 2ms pulse
		ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6, MINSPEED); // 5%
		ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7, MINSPEED);
		ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, MINSPEED);
		ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, MINSPEED);
		
		//Initialize motor values
		g_sMotorInst.motorLeft = MINSPEED;
		g_sMotorInst.motorRight = MINSPEED;
		g_sMotorInst.motorBack = MINSPEED;
		g_sMotorInst.motorFront = MINSPEED;
		
		ROM_PWMGenEnable(PWM1_BASE, PWM_GEN_3);
		ROM_PWMGenEnable(PWM0_BASE, PWM_GEN_1);
		
		// Enable the outputs.
		//
    ROM_PWMOutputState(PWM0_BASE, (PWM_OUT_2_BIT | PWM_OUT_3_BIT), true);
		
		ROM_PWMOutputState(PWM1_BASE, (PWM_OUT_6_BIT | PWM_OUT_7_BIT), true);
		
		
    //
    // Initialize the UART.
    //
    ConfigureUART();
		ConfigureUART1();
		//UART1_Init();  From bluethooth demo
		

    //
    // Print the welcome message to the terminal.
    //
    //UARTprintf("\033[2JMPU9150 Raw Example\n");

    //
    // Set the color to a purple approximation.
    //
//    g_pui32Colors[RED] = 0x8000;
  //  g_pui32Colors[BLUE] = 0x8000;
    //g_pui32Colors[GREEN] = 0x0000;

    //
    // Initialize RGB driver.
    //
//    RGBInit(0);
  //  RGBColorSet(g_pui32Colors);
    //RGBIntensitySet(0.5f);
    //RGBEnable();

    //
    // The I2C3 peripheral must be enabled before use.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_I2C3);
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);

    //
    // Configure the pin muxing for I2C3 functions on port D0 and D1.
    //
    ROM_GPIOPinConfigure(GPIO_PD0_I2C3SCL);
    ROM_GPIOPinConfigure(GPIO_PD1_I2C3SDA);

    //
    // Select the I2C function for these pins.  This function will also
    // configure the GPIO pins pins for I2C operation, setting them to
    // open-drain operation with weak pull-ups.  Consult the data sheet
    // to see which functions are allocated per pin.
    //
    GPIOPinTypeI2CSCL(GPIO_PORTD_BASE, GPIO_PIN_0);
    ROM_GPIOPinTypeI2C(GPIO_PORTD_BASE, GPIO_PIN_1);
		
		//Unlocking PD7 to use as GPIO. Because PD7 defaults to NMI fucntionality
		//Need to unlock to use as an interrupt source
		HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = GPIO_LOCK_KEY;
    HWREG(GPIO_PORTD_BASE + GPIO_O_CR) |= 0x80;
    HWREG(GPIO_PORTD_BASE + GPIO_O_AFSEL) &= ~0x80;   
    HWREG(GPIO_PORTD_BASE + GPIO_O_DEN) |= 0x80;
    HWREG(GPIO_PORTD_BASE + GPIO_O_LOCK) = 0;

    //
    // Configure and Enable the GPIO interrupt. Used for INT signal from the
    // MPU9150
    //
    ROM_GPIOPinTypeGPIOInput(GPIO_PORTB_BASE, GPIO_PIN_2);
    GPIOIntEnable(GPIO_PORTB_BASE, GPIO_PIN_2);
    ROM_GPIOIntTypeSet(GPIO_PORTB_BASE, GPIO_PIN_2, GPIO_FALLING_EDGE);
    ROM_IntEnable(INT_GPIOB);

		//Setting Interrupt on PD7 for HC-05 Bluetooth STATE signal. 
		//This will tell us if the bluetooth module is currently connected
		ROM_GPIOPinTypeGPIOInput(GPIO_PORTD_BASE, GPIO_PIN_7);
		GPIOIntEnable(GPIO_PORTD_BASE, GPIO_PIN_7);
		ROM_GPIOIntTypeSet(GPIO_PORTD_BASE, GPIO_PIN_7, GPIO_BOTH_EDGES);
		ROM_IntEnable(INT_GPIOD);
    //
    // Keep only some parts of the systems running while in sleep mode.
    // GPIOB is for the MPU9150 interrupt pin.
    // UART0 is the virtual serial port
    // TIMER0, TIMER1 and WTIMER5 are used by the RGB driver
    // I2C3 is the I2C interface to the ISL29023
    //
    ROM_SysCtlPeripheralClockGating(true);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_GPIOB);
		ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_GPIOD);
		ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_PWM0);
		ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_PWM1);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_UART0);
		ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_UART1);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_TIMER0);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_TIMER1);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_I2C3);
    ROM_SysCtlPeripheralSleepEnable(SYSCTL_PERIPH_WTIMER5);

    //
    // Enable interrupts to the processor.
    //
    ROM_IntMasterEnable();

    //
    // Initialize I2C3 peripheral.
    //
    I2CMInit(&g_sI2CInst, I2C3_BASE, INT_I2C3, 0xff, 0xff,
             ROM_SysCtlClockGet());

    //
    // Initialize the MPU9150 Driver.
    //
    MPU9150Init(&g_sMPU9150Inst, &g_sI2CInst, MPU9150_I2C_ADDRESS,
                MPU9150AppCallback, &g_sMPU9150Inst);

    //
    // Wait for transaction to complete
    //
    MPU9150AppI2CWait(__FILE__, __LINE__);

    //
    // Write application specifice sensor configuration such as filter settings
    // and sensor range settings.
    //
    g_sMPU9150Inst.pui8Data[0] = MPU9150_CONFIG_DLPF_CFG_94_98;
    g_sMPU9150Inst.pui8Data[1] = MPU9150_GYRO_CONFIG_FS_SEL_250;
    g_sMPU9150Inst.pui8Data[2] = (MPU9150_ACCEL_CONFIG_ACCEL_HPF_5HZ |
                                  MPU9150_ACCEL_CONFIG_AFS_SEL_2G);
    MPU9150Write(&g_sMPU9150Inst, MPU9150_O_CONFIG, g_sMPU9150Inst.pui8Data, 3,
                 MPU9150AppCallback, &g_sMPU9150Inst);

    //
    // Wait for transaction to complete
    //
    MPU9150AppI2CWait(__FILE__, __LINE__);

    //
    // Configure the data ready interrupt pin output of the MPU9150.
    //
    g_sMPU9150Inst.pui8Data[0] = MPU9150_INT_PIN_CFG_INT_LEVEL |
                                    MPU9150_INT_PIN_CFG_INT_RD_CLEAR |
                                    MPU9150_INT_PIN_CFG_LATCH_INT_EN;
    g_sMPU9150Inst.pui8Data[1] = MPU9150_INT_ENABLE_DATA_RDY_EN;
    MPU9150Write(&g_sMPU9150Inst, MPU9150_O_INT_PIN_CFG,
                 g_sMPU9150Inst.pui8Data, 2, MPU9150AppCallback,
                 &g_sMPU9150Inst);

    //
    // Wait for transaction to complete
    //
    MPU9150AppI2CWait(__FILE__, __LINE__);

    //
    // Initialize the DCM system. 50 hz sample rate.
    // accel weight = .2, gyro weight = .8, mag weight = .2
    //
    CompDCMInit(&g_sCompDCMInst, 1.0f / 50.0f, 0.2f, 0.6f, 0.2f);


  /*  UARTprintf("\033[2J\033[H");
    UARTprintf("MPU9150 9-Axis Simple Data Application Example\n\n");
    UARTprintf("\033[20GX\033[31G|\033[43GY\033[54G|\033[66GZ\n\n");
    UARTprintf("Accel\033[8G|\033[31G|\033[54G|\n\n");
    UARTprintf("Gyro\033[8G|\033[31G|\033[54G|\n\n");
    UARTprintf("Mag\033[8G|\033[31G|\033[54G|\n\n");
    UARTprintf("\n\033[20GRoll\033[31G|\033[43GPitch\033[54G|\033[66GYaw\n\n");
    UARTprintf("Eulers\033[8G|\033[31G|\033[54G|\n\n");

    UARTprintf("\n\033[17GQ1\033[26G|\033[35GQ2\033[44G|\033[53GQ3\033[62G|"
               "\033[71GQ4\n\n");
    UARTprintf("Q\033[8G|\033[26G|\033[44G|\033[62G|\n\n");
*/
    //
    // Enable blinking indicates config finished successfully
    //
//    RGBBlinkRateSet(1.0f);

