johnnycuenca/SeniorDesign_Quadcopter_TM4C/compdcm_mpu9150 - Copy/compdcm_mpu9150.c
    ui32CompDCMStarted = 0;

	bool escCalibrated = false;
	
	//Used to store the resulting string in sprintf function at the bottom of the code
	char motorLeftStr[5];
	char motorRightStr[5];
	
	char pvstr[80];
	char mvstr[80];
	char spstr[80];
	char kpstr[80];
  char gyroRollStr[80];
	
	char rangestr[80];
	char errorstr[80];
	char currentspeedstr[80];
	int32_t character = '\0';
	bool canPrintOut = true;
	g_sMotorInst.currentSpeed = MINSPEED;
    while(1)
    {
			
			///////*Bluetooth Code Block**/////////
		 if(UARTCharsAvail(UART1_BASE))
			{
				character = UARTCharGetNonBlocking(UART1_BASE);
				//UARTprintf("UART 1 Recieved %c", character);
							
			if(character == 'A' || character == 'a'){//Zero Speed
					UARTprintf("Received %c - Minimum Speed\n\r", character);
				//Set all PWM pulses to 5%. So this generates a 1ms pulse
				ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6, MINSPEED);
				ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7, MINSPEED);
				ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, MINSPEED);
				ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, MINSPEED);
				
				g_sMotorInst.currentSpeed = MINSPEED;
				
				escCalibrated = true;
				canPrintOut = true;
				
			}
			//Triangle on the bluetooth app
			else if(character == 'W' || character == 'w'){//Increase Speed.
				UARTprintf("Received %c - Increase Speed by 50\n\r", character);
				motor1 = g_sMotorInst.currentSpeed + 50;
				motor2 = motor1;
				motor3 = motor1;
				motor4 = motor1;
				if(motor1 > 1250)
					motor1 = 2000;
				
				g_sMotorInst.currentSpeed = motor1; //Set the current speed of the motor after sending bluetooth commands
				
			}
			/*
			else if(character == 'A' || character == 'a'){//Increase Speed.
				motor2 = motor2 + 100;
				if(motor2 > 1250)
					motor2 = 2000;
			}
			
			else if(character == 'D' || character == 'd'){//Increase Speed.
				motor3 = motor3 + 100;
				if(motor3 > 1250)
					motor3 = 2000;
			}
			*/
			//Circle on the bluetooth app
			else if(character == 'S' || character == 's'){//Decrease Speed.
				UARTprintf("Received %c - Decrease Speed by 50\n\r", character);
				motor1 = g_sMotorInst.currentSpeed - 25;
				motor2 = motor1;
				motor3 = motor1;
				motor4 = motor1;
				
				if(motor1 < 625)
					motor1 = 2000;
				
				g_sMotorInst.currentSpeed = motor1; //Set the current speed of the motor after sending bluetooth commands
			}
			else
				canPrintOut = false; //Stop printing values
			/*
			else if(character == 'I' || character == 'i'){//Decrease Speed.
				motor1 = motor1 - 100;
				if(motor1 < 625)
					motor1 = 2000;
			}
			else if(character == 'J' || character == 'j'){//Decrease Speed.
				motor2 = motor2 - 100;
				if(motor2 < 625)
					motor2 = 2000;
			}
			else if(character == 'K' || character == 'k'){//Decrease Speed.
				motor3 = motor3 - 100;
				if(motor3 < 625)
					motor3 = 2000;
			}
			else if(character == 'L' || character == 'l'){//Decrease Speed.
				motor4 = motor4 - 100;
				if(motor4 < 625)
					motor4 = 2000;
			}
			*/
							
						}
			////////***End Bluetooth Code Block*****///////////////
			
			
        //
        // Go to sleep mode while waiting for data ready.
        //
        while(!g_vui8I2CDoneFlag)
        {
            ROM_SysCtlSleep();
        }

        //
        // Clear the flag
        //
        g_vui8I2CDoneFlag = 0;

        //
        // Get floating point version of the Accel Data in m/s^2.
        //
        MPU9150DataAccelGetFloat(&g_sMPU9150Inst, pfAccel, pfAccel + 1,
                                 pfAccel + 2);

        //
        // Get floating point version of angular velocities in rad/sec
        //
        MPU9150DataGyroGetFloat(&g_sMPU9150Inst, pfGyro, pfGyro + 1,
                                pfGyro + 2);

        //
        // Get floating point version of magnetic fields strength in tesla
        //
        MPU9150DataMagnetoGetFloat(&g_sMPU9150Inst, pfMag, pfMag + 1,
                                   pfMag + 2);

        //
        // Check if this is our first data ever.
        //
        if(ui32CompDCMStarted == 0)
        {
            //
            // Set flag indicating that DCM is started.
            // Perform the seeding of the DCM with the first data set.
            //
            ui32CompDCMStarted = 1;
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, pfGyro[0], pfGyro[1],
                              pfGyro[2]);
            CompDCMStart(&g_sCompDCMInst);
        }
        else
        {
            //
            // DCM Is already started.  Perform the incremental update.
            //
            CompDCMMagnetoUpdate(&g_sCompDCMInst, pfMag[0], pfMag[1],
                                 pfMag[2]);
            CompDCMAccelUpdate(&g_sCompDCMInst, pfAccel[0], pfAccel[1],
                               pfAccel[2]);
            CompDCMGyroUpdate(&g_sCompDCMInst, -pfGyro[0], -pfGyro[1],
                              -pfGyro[2]);
            CompDCMUpdate(&g_sCompDCMInst);
        }

				gyroRoll = pfGyro[0] * 57.295779513082320876798154814105f;
				
        //
        // Increment the skip counter.  Skip counter is used so we do not
        // overflow the UART with data.
        //
        g_ui32PrintSkipCounter++;
				
				/*
        if(g_ui32PrintSkipCounter >= PRINT_SKIP_COUNT)
        {
            //
            // Reset skip counter.
            //
            g_ui32PrintSkipCounter = 0;

            //
            // Get Euler data. (Roll Pitch Yaw)
            //
            CompDCMComputeEulers(&g_sCompDCMInst, pfEulers, pfEulers + 1,
                                 pfEulers + 2);

            //
            // Get Quaternions.
            //
            CompDCMComputeQuaternion(&g_sCompDCMInst, pfQuaternion);

            //
            // convert mag data to micro-tesla for better human interpretation.
            //
            pfMag[0] *= (float)1e6;
            pfMag[1] *= (float)1e6;
            pfMag[2] *= (float)1e6;

            //
            // Convert Eulers to degrees. 180/PI = 57.29...
            // Convert Yaw to 0 to 360 to approximate compass headings.
            //
            pfEulers[0] *= 57.295779513082320876798154814105f;
            pfEulers[1] *= 57.295779513082320876798154814105f;
            pfEulers[2] *= 57.295779513082320876798154814105f;
						
						if(!setPointIsSet)
						{
							PID_InitRoll_SetPoint(&g_sPIDInst, pfEulers[0]);
							initPidConstants(&g_sConstInst);
							//initMotor(g_sMotorInst, 800, 800);
							setPointIsSet = true;
						}
						
            if(pfEulers[2] < 0)
            {
                pfEulers[2] += 360.0f;
            }
						
				if(escCalibrated)
				{
							
						
						updateProcessVar(&g_sPIDInst, pfEulers[0], gyroRoll);
						updateCopterRoll(&g_sPIDInst, &g_sMotorInst, &g_sConstInst);
						
