johnnycuenca/SeniorDesign_Quadcopter_TM4C/compdcm_mpu9150 - Copy/compdcm_mpu9150.c
					//Turn motors off if it passes these angles
						if(pfEulers[0] > 79 || pfEulers[0] < -79)
						{
						
								//g_sMotorInst.currentSpeed = MINSPEED;
														
						}
					
						
						ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6, g_sMotorInst.motorLeft);
						ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7, g_sMotorInst.motorRight);
						ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, g_sMotorInst.motorLeft);
						ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, g_sMotorInst.motorRight);
					}	

            //
            // Now drop back to using the data as a single array for the
            // purpose of decomposing the float into a integer part and a
            // fraction (decimal) part.
            //
            for(ui32Idx = 0; ui32Idx < 16; ui32Idx++)
            {
                //
                // Conver float value to a integer truncating the decimal part.
                //
                i32IPart[ui32Idx] = (int32_t) pfData[ui32Idx];

                //
                // Multiply by 1000 to preserve first three decimal values.
                // Truncates at the 3rd decimal place.
                //
                i32FPart[ui32Idx] = (int32_t) (pfData[ui32Idx] * 1000.0f);

                //
                // Subtract off the integer part from this newly formed decimal
                // part.
                //
                i32FPart[ui32Idx] = i32FPart[ui32Idx] -
                                    (i32IPart[ui32Idx] * 1000);

                //
                // make the decimal part a positive number for display.
                //
                if(i32FPart[ui32Idx] < 0)
                {
                    i32FPart[ui32Idx] *= -1;
                }
            }
						
						
			
							
						

						 //Remember to comment this out if uart skip counter loop is used again//
            //
            // Print the acceleration numbers in the table.
            //
            UARTprintf("\033[5;17H%3d.%03d", i32IPart[0], i32FPart[0]);
            UARTprintf("\033[5;40H%3d.%03d", i32IPart[1], i32FPart[1]);
            UARTprintf("\033[5;63H%3d.%03d", i32IPart[2], i32FPart[2]);

            //
            // Print the angular velocities in the table.
            //
            UARTprintf("\033[7;17H%3d.%03d", i32IPart[3], i32FPart[3]);
            UARTprintf("\033[7;40H%3d.%03d", i32IPart[4], i32FPart[4]);
            UARTprintf("\033[7;63H%3d.%03d", i32IPart[5], i32FPart[5]);

            //
            // Print the magnetic data in the table.
            //
            UARTprintf("\033[9;17H%3d.%03d", i32IPart[6], i32FPart[6]);
            UARTprintf("\033[9;40H%3d.%03d", i32IPart[7], i32FPart[7]);
            UARTprintf("\033[9;63H%3d.%03d", i32IPart[8], i32FPart[8]);

            //
            // Print the Eulers in a table.
            //
            UARTprintf("\033[14;17H%3d.%03d", i32IPart[9], i32FPart[9]);
            UARTprintf("\033[14;40H%3d.%03d", i32IPart[10], i32FPart[10]);
            UARTprintf("\033[14;63H%3d.%03d", i32IPart[11], i32FPart[11]);

            //
            // Print the quaternions in a table format.
            //
            UARTprintf("\033[19;14H%3d.%03d", i32IPart[12], i32FPart[12]);
            UARTprintf("\033[19;32H%3d.%03d", i32IPart[13], i32FPart[13]);
            UARTprintf("\033[19;50H%3d.%03d", i32IPart[14], i32FPart[14]);
            UARTprintf("\033[19;68H%3d.%03d", i32IPart[15], i32FPart[15]);
						
						
						UARTprintf("\n Roll: %3d", (int)pfData[9]);
						UARTprintf("\n %3d", (int)pfData[10]);
						UARTprintf("\n %3d", (int)pfData[11]);
						
						//UP TO HERE//
						
						
						if(canPrintOut)
						{
							sprintf(motorLeftStr, "%5d", (int)g_sMotorInst.motorLeft);
						
							sprintf(motorRightStr, "%5d", (int)g_sMotorInst.motorRight);
							sprintf(pvstr, "%5f", g_sPIDInst.pvEuler); //PID process variable
							sprintf(mvstr, "%5f", g_sPIDInst.mvEuler); // Manipulated Variable
							sprintf(spstr, "%5f", g_sPIDInst.spEuler); // Set Point
							sprintf(gyroRollStr, "%5f", gyroRoll); //Gyro roll value (deg/s)
							
							
							UARTprintf("Current Speed = %d ", g_sMotorInst.currentSpeed);
							UARTprintf("\tLast character received: %c\n\r", character);
							UARTprintf("\tGyro = %s deg/s", gyroRollStr);
							UARTprintf("\tSP = %s ", spstr);
							UARTprintf("\tPV = %s ", pvstr);
							UARTprintf("\tMV = %s\n\r", mvstr);
							
							UARTprintf("Motor Left: %s ", motorLeftStr);
							UARTprintf("\tMotor Right: %s\n\r", motorRightStr);
						}		

        } */
				
				
            // Get Euler data. (Roll Pitch Yaw)
            //
            CompDCMComputeEulers(&g_sCompDCMInst, pfEulers, pfEulers + 1,
                                 pfEulers + 2);

            //
            // Get Quaternions.
            //
            //CompDCMComputeQuaternion(&g_sCompDCMInst, pfQuaternion);

            //
            // convert mag data to micro-tesla for better human interpretation.
            //
            pfMag[0] *= (float)1e6;
            pfMag[1] *= (float)1e6;
            pfMag[2] *= (float)1e6;

            //
            // Convert Eulers to degrees. 180/PI = 57.29...
            // Convert Yaw to 0 to 360 to approximate compass headings.
            //
            pfEulers[0] *= 57.295779513082320876798154814105f;
            pfEulers[1] *= 57.295779513082320876798154814105f;
            pfEulers[2] *= 57.295779513082320876798154814105f;
						
						if(!setPointIsSet)
						{
							//PID_InitRoll_SetPoint(&g_sPIDInst, pfEulers[0]);
							PID_InitPitch_SetPoint(&g_sPIDInst_Pitch, pfEulers[1]);
							initPidConstants(&g_sConstInst);
							//initMotor(g_sMotorInst, 800, 800);
							setPointIsSet = true;
						}
						
            if(pfEulers[2] < 0)
            {
                pfEulers[2] += 360.0f;
            }
						
				if(escCalibrated)
				{
							
						
						//updateProcessVar(&g_sPIDInst, pfEulers[0], gyroRoll);
					  updateProcessVar(&g_sPIDInst_Pitch, pfEulers[1], gyroRoll); //gyroRoll should be gyroPitch change later
						//updateCopterRoll(&g_sPIDInst, &g_sMotorInst, &g_sConstInst);
					  updateCopterPitch(&g_sPIDInst_Pitch, &g_sMotorInst, &g_sConstInst);
					
						
						ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_6, g_sMotorInst.motorBack);
						ROM_PWMPulseWidthSet(PWM1_BASE, PWM_OUT_7, g_sMotorInst.motorFront);
						ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_2, g_sMotorInst.motorLeft);
						ROM_PWMPulseWidthSet(PWM0_BASE, PWM_OUT_3, g_sMotorInst.motorRight);
					}	
					
    }
}
